// 1. เรียกใชงาน Module ที่ชื่อวา 'http' ซึ่งเปนระบบพื้นฐานของ Node.js สําหรับทําเซ�[...]
6. const http = require('http');
7.
8. // 2. กําหนดชองทาง (Port) ที่เซิรฟเวอรจะใชสื่อสาร โดยใหใชของที่ Cloud กํา�[...]
(process.env.PORT) ถาไมมีใหใช 3000
9. const port = process.env.PORT || 3000;
10.
11. // 3. สรางเครื่องแมขาย (Server) ที่คอยรับคําขอ (req) และตอบกลับ (res)
12. const server = http.createServer((req, res) => {
13.
14. // 3.1 ตั้งรหัสสถานะ 200 หมายถึง "ทํางานสําเร็จ (OK)"
15. res.statusCode = 200;
16.
17. // 3.2 บอกเบราวเซอรของผูใชวา สิ่งที่สงกลับไปคือไฟลขอความแบบ HTML ภาษาไทย (utf-8)
18. res.setHeader('Content-Type', 'text/html; charset=utf-8');
19.
20. // 3.3 สงขอมูลหนาเว็บกลับไปหาผูใช
21. res.end('<h1>สวัสดีค่ะ! นี่คือ Web Server ของ [ใสชื่อ-ธัญญาภรณ์ มีเณร 69319010120] </h1><p>เครื่องแมขายทํางานปกติบนระบบ Railway แลวค่ะ!</p>');
22. });
23.
24. // 4. สั่งใหเซิรฟเวอรเริ่มตนเปดรับฟงการเชื่อมตอตาม Port ที่กําหนด[...]
25. server.listen(port, () => {
26. console.log(`Server is running! เคร่อืงแมขายเปดทํางานแลวที่ชองทาง: ${port}`);
27. });
